Repository: nibir-coderaxis/Bangla-Dictionary
Catalog: locale/*/LC_MESSAGES/django.po
Languages: bn

source: Bangla
bn: বাংলা

source: English
bn: ইংরেজী

source: Name
bn: নাম

source: Source Language
bn: মূল ভাষা

source: Target Language
bn: অনুদিত ভাষা

source: Abbreviation
bn: সংক্ষেপণ

source: Parts of Speech
bn: পদ

source: Alphabets
bn: বর্ণ

source: Dictionary
bn: অভিধান

source: Dictionaries
bn: অভিধান তালিকা

source: Accepted
bn: গৃহীত

source: Rejected
bn: বাতিল

source: Closed
bn: বন্ধ

source: alpha
bn: বর্ণ

source: Original
bn: মূল

source: Translation
bn: অর্থ

source: Phoneme
bn: উচ্চারণ

source: Description
bn: বর্ণনা

source: Synonyms
bn: সমার্থক শব্দ

source: Antonyms
bn: বিপরীত শব্দ

source: Contributor
bn: প্রদায়ক

source: Status
bn: অবস্থা

source: Added at
bn: সময়

source: Uploaded at
bn: আপলোডের সময়

source: File
bn: ফাইল

source: Already uploaded this file
bn: এই ফাইলটি ইতোমধ্যে সংরক্ষণ করা হয়েছে।

source: Thanks for the input. It will be added to the database soon
bn: ধন্যবাদ। শব্দগুলো যথাসময়ে সংরক্ষিত হবে।

source: Could not save this file.
bn: এই ফাইলটি সংরক্ষণ করা সম্ভব হয়নি।

source: No file uploaded. Please select a file to upload
bn: কোন ফাইল দেয়া হয়নি। অনুগ্রহ করে একটি ফাইল দিন।

source: Page not found
bn: পাতা নিখোঁজ

source: The page you requested could not be found.
bn: অনুরোধকৃত পাতাটি পাওয়া যায়নি

source: Server error
bn: সার্ভার সমস্যা

source: There was an error while handling your request.
bn: সার্ভারে বিঘ্ন ঘটায় আপনার অনুরোধটি সম্পন্ন করা সম্ভব হয়নি।

source: Bangla Dictionary
bn: বাংলা অভিধান

source: Welcome
bn: স্বাগতম

source: Logout
bn: লগআউট

source: Login with your Google Account
bn: আপনার গুগল একাউন্ট দিয়ে লগইন করুন

source: Home
bn: নীড়পাতা

source: Contributors
bn: প্রদায়ক

source: Profile
bn: প্রোফাইল

source: Upload
bn: আপলোড

source: Search
bn: খুঁজুন

source: Upload words
bn: শব্দ আপলোড করুন

source: Submit
bn: প্রকাশ করুন

source: New words
bn: নতুন শব্দ

source: Word
bn: শব্দ

source: Added by
bn: সংকলনে

source: Edit
bn: সম্পাদনা

source: Comments
bn: মন্তব্য

source: Post your comment
bn: আপনার মন্তব্য প্রকাশ করুন

source: Create new
bn: নতুন শব্দ যোগ করুন

source: Please select one
bn: অনুগ্রহপূর্বক একটি বাছাই করুন

source: List
bn: তালিকা

source: Add a new word
bn: নতুন শব্দ যোগ করুন

source: Accept
bn: গ্রহণ করুন

source: Reject
bn: বাতিল করুন

source: No word found!
bn: কোন শব্দ পাওয়া যায়নি!

source: Post
bn: প্রকাশ করুন

source: Preview your comment
bn: প্রিভিউ দেখুন

source: Please correct the error below
bn: অনুগ্রহ করে নিম্নোক্ত সমস্যাগুলো সঠিক করুন

source: and
bn: এবং

source: or make changes
bn: অথবা বদলান

source: Preview
bn: প্রিভিউ

source: Accepted words
bn: শব্দসংখ্যা

source: Total words
bn: সর্বমোট শব্দসংখ্যা

source: Currently working
bn: বর্তমানে কাজ করছেন

source: Edit your profile
bn: আপনার প্রোফাইল সম্পাদন করুন

source: Username
bn: সদস্যনাম

source: Full name
bn: পুরো নাম

source: Email
bn: ইমেইল

source: Joined on
bn: যোগদানের সময়

source: Website
bn: ওয়েবসাইট

source: Instant messenger IDs
bn: ম্যাসেঞ্জার আইডি

source: Total contributed words
bn: সর্বমোট শব্দ সংখ্যা

source: Currently working on
bn: বর্তমানে কাজ করছেন

source: from
bn: শুরু

source: to
bn: পর্যন্ত
